import asyncio
import datetime

from aiogram import Router, F
from aiogram.types import Message, CallbackQuery
from aiogram.filters import CommandStart, Command

# from app.database.requests import set_user
# from middlewares import BaseMiddleware

user = Router()

DAYS_PLAN = {
    0: {
        "morning": "🌅 <b>Доброе утро</b>\n\n"
                   "В дороге сегодня:\n"
                   "<b>Русский язык</b>\n"
                   "▸ <b>ударения, орфография</b> - ⏱ 10–15 минут\n\n"
                   "Просто посмотри, без напряга 👍",
        "afternoon": "🌙 <b>План на вечер</b>\n\n"
                     "Русский язык\n"
                     "▸ орфография\n"
                     "▸ <b>5–7 заданий - ⏱ 40–60 минут</b>\n\n"
                     "Этого достаточно ✅",
    },
    1: {
         "morning": "🌅 <b>Утро</b>\n\n"
                   "Сегодня в дороге:\n"
                   "<b>Информатика</b>\n"
                   "▸ <b>теория, логика, алгоритмы</b> - ⏱ 10–15 минут\n\n"
                   "Без задач, просто понять 🧠",
        "afternoon": "🌙 <b>Сегодня вечером</b>\n\n"
                     "Математика (ОГЭ)\n"
                     "▸ 5–8 заданий\n"
                     "▸ без спешки\n\n"
                     "Главное — понять ошибки 🧠",
    },
    2: {
        "morning": "🌅 <b>Утро</b>\n\n"
                   "В дороге:\n"
                   "<b>Обществознание</b>\n"
                   "▸ <b>термины и определения</b> - 10–15 минут — и готово ✅\n\n",
        "afternoon": "🌙 <b>План простой</b>\n\n"
                     "Обществознание\n"
                     "▸ термины\n"
                     "▸ <b>1 тема - ⏱ ~40 минут</b>\n\n"
                     "Потом отдых 👍",
    },
    3: {
        "morning": "🌅 <b>Утро</b>\n\n"
                   "Сегодня:\n"
                   "<b>Русский язык</b>\n"
                   "▸ <b>правила + примеры</b> - ⏱ 10–15 минут\n\n"
                   "Лёгкий старт дня 👍",
        "afternoon": "🌙 <b>Вечер</b>\n\n"
                     "Информатика\n"
                     "▸ 5–7 заданий\n"
                     "ИЛИ\n"
                     "▸ теория + 2 задачи\n\n"
                     "Выбирай сам 💪",
    },
    4: {
        "morning": "🌅 <b>Пятница 😌</b>\n\n"
                   "Сегодня в дороге:\n"
                   "<b>Лёгкий повтор</b>\n"
                   "▸ <b>▸ что запомнилось за неделю</b> - ⏱ 10–15 минут\n\n"
                   "Без давления.",
        "afternoon": "🌙 <b>Пятница</b>\n\n"
                     "Сегодня\n"
                     "💻 Программирование\n"
                     "ИЛИ\n"
                     "😴 отдых",
    },
    5: {
        "morning": "🌅 <b>Суббота</b>\n\n"
                   "Сегодня допы по обществу\n"
                   "<b>Просто настройся, без учёбы сейчас 👍</b>\n",
        "afternoon": "🌙 <b>После допов</b>\n\n"
                     "Сегодня можно:\n"
                         "💻 Программирование\n"
                     "ИЛИ\n"
                     "▸ или разобрать ошибки\n"
                     "⏱ <b>до 1 часа</b>",
    },
    6: {
        "morning": "🌅 <b>Доброе утро</b>\n\n"
                   "Сегодня без школы\n"
                   "<b>Позже будет спокойный повтор ✌️</b>\n",
        "afternoon": "🌙 <b>Спокойный вечер</b>\n\n"
                     "▸ лёгкий повтор\n"
                     "▸ или полный отдых\n"
                     "Подготовка — это марафон 🏃‍♂️"
    }
}


async def check_time_notification(message: Message):
    sent_morning = False
    sent_evening = False

    while True:
        time = datetime.datetime.now()
        day = datetime.datetime.today().weekday()

        if time.hour == 7 and time.minute == 30 and not sent_morning:
            sent_morning = True

            await message.bot.send_message(
                chat_id=message.chat.id,
                text=f'{DAYS_PLAN[day]["morning"]}'
            )

            await asyncio.sleep(61)
        elif time.hour == 20 and time.minute == 00 and not sent_evening:
            sent_evening = True

            await message.bot.send_message(
                    chat_id=message.chat.id,
                    text=f'{DAYS_PLAN[day]["afternoon"]}'
                )

            await asyncio.sleep(61)
        elif time.hour == 00 and time.minute == 00:
            sent_morning = False
            sent_evening = False
        else:
            await asyncio.sleep(60)


@user.message(CommandStart())
async def cmd_start(message: Message):
    print('Запуск')
    await message.answer('Добро пожаловать в бот!')
    await asyncio.create_task(check_time_notification(message))
